Revit 2024 API
AssetPropertyDouble Class
 Represents a property of material.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class AssetPropertyDouble : AssetProperty
Visual Basic
Public Class AssetPropertyDouble _
	Inherits AssetProperty
Visual C++
public ref class AssetPropertyDouble : public AssetProperty
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetPropertyDouble
See Also
AssetPropertyDouble Members
Autodesk.Revit.DB.Visual Namespace